math251/exam_review_2.tex
% Created 2024-10-18 Fri 09:52
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper, 12pt]{article}
                                \usepackage{lmodern} % Ensures we have the right font
\usepackage[T1]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage{graphicx}
\usepackage{amsmath, amsthm, amssymb}
\usepackage[table, xcdraw]{xcolor}
\usepackage{tikz}
\usetikzlibrary{automata, positioning, arrows}
\renewcommand{\thesection}{\Roman{section}}
\renewcommand{\thesubsection}{}
\renewcommand{\thesubsubsection}{}
\definecolor{bblue}{HTML}{0645AD}
\usepackage[colorlinks]{hyperref}
\hypersetup{colorlinks, linkcolor=blue, urlcolor=bblue}
\usepackage{titling}
\setlength{\droptitle}{-6em}
\setlength{\parindent}{12pt}
\setlength{\parskip}{0em}
\usepackage[stretch=10]{microtype}
\usepackage{hyphenat}
\usepackage{ragged2e}
\usepackage{subfig} % Subfigures (not needed in Org I think)
\usepackage{hyperref} % Links
\usepackage{listings} % Code highlighting
\usepackage[top=1in, bottom=1.00in, left=0.85in, right=0.85in]{geometry}
\renewcommand{\baselinestretch}{1.00}
\usepackage[explicit]{titlesec}
\pretitle{\begin{center}\fontsize{20pt}{20pt}\selectfont}
\posttitle{\par\end{center}}
\preauthor{\begin{center}\vspace{-6bp}\fontsize{12pt}{12pt}\selectfont}
\postauthor{\par\end{center}\vspace{-25bp}}
\predate{\begin{center}\fontsize{12pt}{12pt}\selectfont\vspace{1em}}
\postdate{\par\end{center}\vspace{0em}}
\titlespacing\section{0pt}{5pt}{5pt} % left margin, space before section header, space after section header
\titlespacing\subsection{0pt}{5pt}{2pt} % left margin, space before subsection header, space after subsection header
\titlespacing\subsubsection{0pt}{5pt}{-2pt} % left margin, space before subsection header, space after subsection header
\usepackage{enumitem}
\setlist{itemsep=-2pt} % or \setlist{noitemsep} to leave space around whole list
\usepackage{listings}
\date{\today}
\title{Exam Review 2}
\hypersetup{
 pdfauthor={},
 pdftitle={Exam Review 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{1.8}
\label{sec:org43b0f7c}
\begin{enumerate}
\item Determine if a given transformation is linear/non-linear\\
\begin{itemize}
\item Given T: R \(\rightarrow\) R\textsuperscript{n}, want to determine if T is linear or non-linear\\
\begin{itemize}
\item or x \(\rightarrow\) *\\
\end{itemize}
\item Calculate T(u), T(v), and T(u + v)\\
\item Calculate T(ku) and kT(u)\\
\item Examples at the very bottom of completed lecture notes for 1.8\\
\end{itemize}
\item Given a linear transformation T, find the associated matrix A such that T = T\textsubscript{A}\\
\begin{itemize}
\item \(\begin{bmatrix}T(e_1)&T(e_2)&...&T(e_n)\end{bmatrix}\)\\
\item Example at the very bottom of page 2\\
\item Practice HW problem similar to this\\
\end{itemize}
\end{enumerate}
\section{1.9}
\label{sec:orgbead088}
\begin{enumerate}
\item Find a standard matrix given T\textsubscript{1}, T\textsubscript{2} to find standard matrix for the transformation\\
\begin{itemize}
\item Given a linear transformation TA: R\textsuperscript{n} \(\rightarrow\) m and T\textsubscript{B}: R\textsuperscript{m} \(\rightarrow\) R\textsuperscript{k} define the composition (T\textsubscript{B} \(\cdot\) T\textsubscript{A})(x) to be the function T\textsubscript{B}(T\textsubscript{A}(x))\\
\begin{itemize}
\item T\textsubscript{B} \(\cdot\) T\textsubscript{A} = T\textsubscript{BA}\\
\end{itemize}
\item Do the mat mul for T\textsubscript{1} \(\cdot\) T\textsubscript{2} = T\textsubscript{A}T\textsubscript{B} and T\textsubscript{2} \(\cdot\) T\textsubscript{1} = T\textsubscript{B}T\textsubscript{A}\\
\begin{itemize}
\item Example 1 and 2\\
\end{itemize}
\end{itemize}
\item Construct the standard matrix for a linear transformation to\\
\begin{itemize}
\item Reflect across the line y=x\\
\begin{itemize}
\item \(\begin{bmatrix}0&1\\1&0\end{bmatrix}\) \(\begin{bmatrix}a\\b\end{bmatrix}\) = \(\begin{bmatrix}b\\a\end{bmatrix}\)\\
\end{itemize}
\item Reflect across the x axis\\
\begin{itemize}
\item \(\begin{bmatrix}1&0\\0&-1\end{bmatrix}\) \(\begin{bmatrix}a\\b\end{bmatrix}\) = \(\begin{bmatrix}a\\-b\end{bmatrix}\)\\
\end{itemize}
\item Reflect across the y axis\\
\begin{itemize}
\item \(\begin{bmatrix}-1&0\\0&1\end{bmatrix}\) \(\begin{bmatrix}a\\b\end{bmatrix}\) = \(\begin{bmatrix}-a\\b\end{bmatrix}\)\\
\end{itemize}
\end{itemize}
\end{enumerate}
\section{2.1}
\label{sec:org2174aeb}
\begin{enumerate}
\item Cofactor Expansion across any row or column (ONLY 3x3!) to find determinant\\
\begin{itemize}
\item \(det(\begin{bmatrix}a_{11}&a_{12}&a_{13}\\a_{21}&a_{22}&a_{23}\\a_{31}&a_{32}&a_{33}\end{bmatrix})\)\\
\item Choose a row or col that has the most 0 entries\\
\item Remember \((-1)^{i+j}\)\\
\end{itemize}
\end{enumerate}
\section{2.2}
\label{sec:orgf0f3fea}
\begin{enumerate}
\item Using elementary row operations to compute the determinant\\
\begin{itemize}
\item For a square matrix A, if A has a row or column of zeros, then det(A) = 0\\
\item For a square matrix A, det(A) = det(A\textsuperscript{T})\\
\item Swapping 2 rows of A to make B, then det(B) = -det(A)\\
\item Multiplying a row by a number to make B, then det(B) = kdet(a)\\
\item Adding a multiple of another row to make B, then det(B) = det(A)\\
\end{itemize}
\end{enumerate}
\section{2.3}
\label{sec:org3e39d71}
\begin{enumerate}
\item Prove det(A\textsuperscript{-1}) = \frac{1}{det(A)}\\
\begin{itemize}
\item We'll need to work this out from start to finish\\
\item ``Just a couple of lines'' - Dr. Le\\
\end{itemize}
\item Prove det(ABC) = det(A)det(B)det(C)\\
\begin{itemize}
\item det(ABC) = det[(AB)C]\\
\item = det(AB)det(C)\\
\item = det(A)det(B)det(C)\\
\end{itemize}
\item Use a determinant to determine if a matrix is singular or non-singular (singular meaning non)\\
\begin{itemize}
\item \(\neq\) 0 means invertible or non-singular\\
\item = 0 means singular or non-invertible\\
\end{itemize}
\end{enumerate}
\section{3.1}
\label{sec:orge6d2aab}
\begin{enumerate}
\item draw vectors (a,b)\\
\begin{itemize}
\item Basically just graph them from the origin\\
\end{itemize}
\item Write vector as a linear combination of other vectors\\
\begin{itemize}
\item Given u\textsuperscript{\(\rightarrow\)} and v\textsuperscript{\(\rightarrow\)} find w\textsuperscript{\(\rightarrow\)} such that w\textsuperscript{\(\rightarrow\)} can be written as a linear combination of u\textsuperscript{\(\rightarrow\)} and v\textsuperscript{\(\rightarrow\)}\\
\item w\textsuperscript{\(\rightarrow\)} = au\textsuperscript{\(\rightarrow\)} + bv\textsuperscript{\(\rightarrow\)}\\
\item Then solve the corresponding linear system for a \& b\\
\item Example 3\\
\item \(\begin{bmatrix}\end{bmatrix}\)\\
\end{itemize}
\end{enumerate}
\section{3.2}
\label{sec:org56a75c7}
\begin{enumerate}
\item Find the distance between 2 vectors u\textsuperscript{\(\rightarrow\)} = (u\textsubscript{1}, u\textsubscript{2}, u\textsubscript{3}) and v\textsuperscript{\(\rightarrow\)} = (v\textsubscript{1}, v\textsubscript{2}, v\textsubscript{3})\\
\begin{itemize}
\item d(u\textsuperscript{\(\rightarrow\)}, v\textsuperscript{\(\rightarrow\)})\\
\item \(\sqrt{(v_{1}-u_{1})^{2} + (v_{2}-u_{2})^{2} + (v_{3}-u_{3})^{2}}\)\\
\end{itemize}
\item Angle between 2 vectors\\
\begin{itemize}
\item \(cos\theta{} = \frac{u \cdot{} v}{||u||||v||}\)\\
\begin{itemize}
\item Norm (|| ||) is \(\sqrt{u_{1}^{2} + u_{2}^{2} + ... + u_{n}^{2}}\)\\
\end{itemize}
\item \(\theta{} = cos^{-1}( \text{see above} )\)\\
\end{itemize}
\end{enumerate}
\section{3.3}
\label{sec:org699511f}
\begin{enumerate}
\item Equation of a plane given a point (x\textsubscript{0}, y\textsubscript{0}, z\textsubscript{0}) and normal vector (a, b, c)\\
\begin{itemize}
\item \(a(x - x_{0}) + b(y - y_{0}) + c(z - z_{0}) = 0\)\\
\end{itemize}
\item Given u and a Vector component of u along a\\
\begin{itemize}
\item \(w_{1} = proj_{a}(u) = \frac{u \cdot{} a}{a \cdot{} a} \times{} a\)\\
\item \(w{_2} = proj_{a}(u) = u - w_{1}\)\\
\end{itemize}
\end{enumerate}
\end{document}
